backend/app/controllers/account_creds_controller.rb

SELECT "account_creds".* FROM "account_creds" WHERE "account_creds"."email" = ? LIMIT ?  [["email", "a"], ["LIMIT", 1]]
---
  def verify
    parsed_body = JSON.parse(request.body.read)
    account_cred = AccountCred.find_by(email: parsed_body['email'])