backend/app/controllers/application_controller.rb

  def authorize_request(authorized_role)
    header = request.headers['Authorization']
    header = header.split(' ').last if header
    begin
      @decoded = JsonWebToken.decode(header)
      if @decoded[:role] == authorized_role
        @current_user = User.find(@decoded[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]