backend/app/controllers/articles_controller.rb

  def index
    render json: Article.all
---
SELECT "articles".* FROM "articles"

  def show
    render json: Article.find(params[:id].to_i)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    parsed_body = JSON.parse(request.body.read)
    Article.create(title: parsed_body['title'], body: parsed_body['body'], author: parsed_body['author'])
---
INSERT INTO "articles" ("title", "body", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Test"], ["body", "Ceci est un test"], ["author", "Reblochon"], ["created_at", "2023-01-10 14:03:43.564850"], ["updated_at", "2023-01-10 14:03:43.564850"]]

  def delete
    Article.destroy(params[:id].to_i)
---
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 8]]

  def modify
    parsed_body = JSON.parse(request.body.read)
    article = Article.find(params[:id].to_i)
    article.update(title: parsed_body['title'], body: parsed_body['body'], author: parsed_body['author'])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "body" = ?, "author" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "toto"], ["body", "tata"], ["author", "titi"], ["updated_at", "2023-01-10 15:00:11.863097"], ["id", 16]]