backend/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "pwd", "role", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "first_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["first_name", "Emile"], ["updated_at", "2023-04-11 11:59:36.479382"], ["id", 2]]

  def verify
    parsed_body = JSON.parse(request.body.read)
    user = User.find_by(email: parsed_body['email'])
    puts(parsed_body)
    puts(user)
    if !user || user.pwd != parsed_body['pwd']
      render json: {status: 'unauthorized'}, status: :unauthorized
      return
    end
    token = JsonWebToken.encode(user_id: user.id, role: user.role)
    time = Time.now + 24.hours.to_i
    render json: {token: token, exp: time.strftime("%m-%d-%Y %H:%M"), account_id: user.id, first_name: user.first_name, last_name: user.last_name, status: 'accepted'}, status: :accepted
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "toto@email.com"], ["LIMIT", 1]]
SELECT "users".* FROM "users"